LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/**
 *
 * @file SYSCTL_RegisterPeripheral.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 23 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 23 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_H_

#include <xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterAddress.h>
#include <xDriver_MCU/SYSCTL/Peripheral/Struct/xHeader/SYSCTL_StructPeripheral.h>

#define SYSCTL    ((SYSCTL_t*) (SYSCTL_BASE))

/*******************************************************************************************
************************************ 1 DID0 *********************************************
*******************************************************************************************/
#define SYSCTL_DEVICE_ID0    ((DEVICE_ID0_t*) (SYSCTL_BASE + DEVICE_ID0_OFFSET))
#define SYSCTL_DEVICE_ID0_R    (*((volatile const UBase_t*) (SYSCTL_BASE + DEVICE_ID0_OFFSET)))

/******************************************************************************************
************************************ 2 DID1 *********************************************
******************************************************************************************/
#define SYSCTL_DEVICE_ID1    ((DEVICE_ID1_t*) (SYSCTL_BASE + DEVICE_ID1_OFFSET))
#define SYSCTL_DEVICE_ID1_R    (*((volatile const UBase_t*) (SYSCTL_BASE + DEVICE_ID1_OFFSET)))

/******************************************************************************************
************************************ 3 PTBOCTL *********************************************
******************************************************************************************/
#define SYSCTL_PTBO_CTL    ((PTBO_CTL_t*) (SYSCTL_BASE + PTBO_CTL_OFFSET))
#define SYSCTL_PTBO_CTL_R    (*((volatile UBase_t*) (SYSCTL_BASE + PTBO_CTL_OFFSET)))

/******************************************************************************************
************************************ 4 RIS *********************************************
******************************************************************************************/
#define SYSCTL_RIS    ((SYSCTL_RIS_t*) (SYSCTL_BASE + SYSCTL_RIS_OFFSET))
#define SYSCTL_RIS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_RIS_OFFSET)))

/******************************************************************************************
************************************ 5 IMC *********************************************
******************************************************************************************/
#define SYSCTL_IMC    ((SYSCTL_IMC_t*) (SYSCTL_BASE + SYSCTL_IMC_OFFSET))
#define SYSCTL_IMC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_IMC_OFFSET)))

/******************************************************************************************
************************************ 6 MISC *********************************************
******************************************************************************************/
#define SYSCTL_MISC    ((SYSCTL_MISC_t*) (SYSCTL_BASE + SYSCTL_MISC_OFFSET))
#define SYSCTL_MISC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_MISC_OFFSET)))

/******************************************************************************************
************************************ 7 RESC *********************************************
******************************************************************************************/
#define SYSCTL_RESC    ((SYSCTL_RESC_t*) (SYSCTL_BASE + SYSCTL_RESC_OFFSET))
#define SYSCTL_RESC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RESC_OFFSET)))

/******************************************************************************************
************************************ 8 PWRTC *********************************************
******************************************************************************************/
#define SYSCTL_PWRTC    ((SYSCTL_PWRTC_t*) (SYSCTL_BASE + SYSCTL_PWRTC_OFFSET))
#define SYSCTL_PWRTC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PWRTC_OFFSET)))

/******************************************************************************************
************************************ 9 NMIC *********************************************
******************************************************************************************/
#define SYSCTL_NMIC    ((SYSCTL_NMIC_t*) (SYSCTL_BASE + SYSCTL_NMIC_OFFSET))
#define SYSCTL_NMIC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_NMIC_OFFSET)))

/******************************************************************************************
************************************ 10 MOSCCTL *********************************************
******************************************************************************************/
#define SYSCTL_MOSC_CTL    ((MOSC_CTL_t*) (SYSCTL_BASE + MOSC_CTL_OFFSET))
#define SYSCTL_MOSC_CTL_R    (*((volatile UBase_t*) (SYSCTL_BASE + MOSC_CTL_OFFSET)))

/******************************************************************************************
************************************ 11 RSCLKCFG *********************************************
******************************************************************************************/
#define SYSCTL_RSCLK_CFG    ((RSCLK_CFG_t*) (SYSCTL_BASE + RSCLK_CFG_OFFSET))
#define SYSCTL_RSCLK_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + RSCLK_CFG_OFFSET)))

/******************************************************************************************
************************************ 12 MEMTIM0 *********************************************
******************************************************************************************/
#define SYSCTL_MEMORY_TIM0    ((MEMORY_TIM0_t*) (SYSCTL_BASE + MEMORY_TIM0_OFFSET))
#define SYSCTL_MEMORY_TIM0_R    (*((volatile UBase_t*) (SYSCTL_BASE + MEMORY_TIM0_OFFSET)))

/******************************************************************************************
************************************ 13 ALTCLKCFG *********************************************
******************************************************************************************/
#define SYSCTL_ALTCLK_CFG    ((ALTCLK_CFG_t*) (SYSCTL_BASE + ALTCLK_CFG_OFFSET))
#define SYSCTL_ALTCLK_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + ALTCLK_CFG_OFFSET)))

/******************************************************************************************
************************************14 DSCLKCFG *********************************************
******************************************************************************************/
#define SYSCTL_DSCLK_CFG    ((DSCLK_CFG_t*) (SYSCTL_BASE + DSCLK_CFG_OFFSET))
#define SYSCTL_DSCLK_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + DSCLK_CFG_OFFSET)))

/******************************************************************************************
************************************15 DIVSCLK *********************************************
******************************************************************************************/
#define SYSCTL_DIVSCLK_CFG    ((DIVSCLK_CFG_t*) (SYSCTL_BASE + DIVSCLK_CFG_OFFSET))
#define SYSCTL_DIVSCLK_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + DIVSCLK_CFG_OFFSET)))

/******************************************************************************************
************************************16 SYSPROP *********************************************
******************************************************************************************/
#define SYSCTL_PROP    ((SYSCTL_PROP_t*) (SYSCTL_BASE + SYSCTL_PROP_OFFSET))
#define SYSCTL_PROP_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PROP_OFFSET)))

/******************************************************************************************
************************************17 PIOSCCAL *********************************************
******************************************************************************************/
#define SYSCTL_PIOSC_CAL    ((PIOSC_CAL_t*) (SYSCTL_BASE + PIOSC_CAL_OFFSET))
#define SYSCTL_PIOSC_CAL_R    (*((volatile UBase_t*) (SYSCTL_BASE + PIOSC_CAL_OFFSET)))

/******************************************************************************************
************************************18 PIOSCSTAT *********************************************
******************************************************************************************/
#define SYSCTL_PIOSC_STAT    ((PIOSC_STAT_t*) (SYSCTL_BASE + PIOSC_STAT_OFFSET))
#define SYSCTL_PIOSC_STAT_R    (*((volatile UBase_t*) (SYSCTL_BASE + PIOSC_STAT_OFFSET)))

/******************************************************************************************
************************************19 PLLFREQ0 *********************************************
******************************************************************************************/
#define SYSCTL_PLL_FREQ0    ((PLL_FREQ0_t*) (SYSCTL_BASE + PLL_FREQ0_OFFSET))
#define SYSCTL_PLL_FREQ0_R    (*((volatile const UBase_t*) (SYSCTL_BASE + PLL_FREQ0_OFFSET)))

/******************************************************************************************
************************************20 PLLFREQ1 *********************************************
******************************************************************************************/
#define SYSCTL_PLL_FREQ1    ((PLL_FREQ1_t*) (SYSCTL_BASE + PLL_FREQ1_OFFSET))
#define SYSCTL_PLL_FREQ1_R    (*((volatile UBase_t*) (SYSCTL_BASE + PLL_FREQ1_OFFSET)))

/******************************************************************************************
************************************21 PLLSTAT *********************************************
******************************************************************************************/
#define SYSCTL_PLL_STAT    ((PLL_STAT_t*) (SYSCTL_BASE + PLL_STAT_OFFSET))
#define SYSCTL_PLL_STAT_R    (*((volatile const UBase_t*) (SYSCTL_BASE + PLL_STAT_OFFSET)))

/******************************************************************************************
************************************22 SLPPWRCFG *********************************************
******************************************************************************************/
#define SYSCTL_SLPPWR_CFG    ((SLPPWR_CFG_t*) (SYSCTL_BASE + SLPPWR_CFG_OFFSET))
#define SYSCTL_SLPPWR_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + SLPPWR_CFG_OFFSET)))

/******************************************************************************************
************************************23 DSLPPWRCFG *********************************************
******************************************************************************************/
#define SYSCTL_DSLPPWR_CFG    ((DSLPPWR_CFG_t*) (SYSCTL_BASE + DSLPPWR_CFG_OFFSET))
#define SYSCTL_DSLPPWR_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + DSLPPWR_CFG_OFFSET)))

/**********************************************************************************
************************************24 NVMSTAT *********************************************
******************************************************************************************/
#define SYSCTL_NVM_STAT    ((NVM_STAT_t*) (SYSCTL_BASE + NVM_STAT_OFFSET))
#define SYSCTL_NVM_STAT_R    (*((volatile const UBase_t*) (SYSCTL_BASE + NVM_STAT_OFFSET)))

/******************************************************************************************
************************************25 LDOSPCTL *********************************************
******************************************************************************************/
#define SYSCTL_LDO_SPCTL    ((LDO_SPCTL_t*) (SYSCTL_BASE + LDO_SPCTL_OFFSET))
#define SYSCTL_LDO_SPCTL_R    (*((volatile UBase_t*) (SYSCTL_BASE + LDO_SPCTL_OFFSET)))

/******************************************************************************************
************************************26 LDOSPCAL *********************************************
******************************************************************************************/
#define SYSCTL_LDO_SPCAL    ((LDO_SPCAL_t*) (SYSCTL_BASE + LDO_SPCAL_OFFSET))
#define SYSCTL_LDO_SPCAL_R    (*((volatile const UBase_t*) (SYSCTL_BASE + LDO_SPCAL_OFFSET)))

/******************************************************************************************
************************************27 LDODPCTL *********************************************
******************************************************************************************/
#define SYSCTL_LDO_DPCTL    ((LDO_DPCTL_t*) (SYSCTL_BASE + LDO_DPCTL_OFFSET))
#define SYSCTL_LDO_DPCTL_R    (*((volatile UBase_t*) (SYSCTL_BASE + LDO_DPCTL_OFFSET)))

/******************************************************************************************
************************************28 LDODPCAL *********************************************
******************************************************************************************/
#define SYSCTL_LDO_DPCAL    ((LDO_DPCAL_t*) (SYSCTL_BASE + LDO_DPCAL_OFFSET))
#define SYSCTL_LDO_DPCAL_R    (*((volatile UBase_t*) (SYSCTL_BASE + LDO_DPCAL_OFFSET)))

/******************************************************************************************
************************************29 SDPMST *********************************************
******************************************************************************************/
#define SYSCTL_SDP_MST    ((SDP_MST_t*) (SYSCTL_BASE + SDP_MST_OFFSET))
#define SYSCTL_SDP_MST_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SDP_MST_OFFSET)))

/******************************************************************************************
************************************30 RESBEHAVCTL *********************************************
******************************************************************************************/
#define SYSCTL_RESET_BEHAVCTL    ((RESET_BEHAVCTL_t*) (SYSCTL_BASE + RESET_BEHAVCTL_OFFSET))
#define SYSCTL_RESET_BEHAVCTL_R    (*((volatile UBase_t*) (SYSCTL_BASE + RESET_BEHAVCTL_OFFSET)))

/******************************************************************************************
************************************31 HSSR *********************************************
******************************************************************************************/
#define SYSCTL_HSSR    ((SYSCTL_HSSR_t*) (SYSCTL_BASE + SYSCTL_HSSR_OFFSET))
#define SYSCTL_HSSR_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_HSSR_OFFSET)))

/******************************************************************************************
************************************32 USBPDS *********************************************
******************************************************************************************/
#define SYSCTL_USB_PDS    ((USB_PDS_t*) (SYSCTL_BASE + USB_PDS_OFFSET))
#define SYSCTL_USB_PDS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + USB_PDS_OFFSET)))

/******************************************************************************************
************************************33 USB_MPC *********************************************
******************************************************************************************/
#define SYSCTL_USB_MPC    ((USB_MPC_t*) (SYSCTL_BASE + USB_MPC_OFFSET))
#define SYSCTL_USB_MPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + USB_MPC_OFFSET)))

/******************************************************************************************
************************************34 EMACPDS *********************************************
******************************************************************************************/
#define SYSCTL_EMAC_PDS    ((EMAC_PDS_t*) (SYSCTL_BASE + EMAC_PDS_OFFSET))
#define SYSCTL_EMAC_PDS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + EMAC_PDS_OFFSET)))
/******************************************************************************************
************************************35 EMACMPC *********************************************
******************************************************************************************/
#define SYSCTL_EMAC_MPC    ((EMAC_MPC_t*) (SYSCTL_BASE + EMAC_MPC_OFFSET))
#define SYSCTL_EMAC_MPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + EMAC_MPC_OFFSET)))

/******************************************************************************************
************************************36 CAN0PDS *********************************************
******************************************************************************************/
#define SYSCTL_CAN0_PDS    ((CAN0_PDS_t*) (SYSCTL_BASE + CAN0_PDS_OFFSET))
#define SYSCTL_CAN0_PDS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + CAN0_PDS_OFFSET)))

/******************************************************************************************
************************************37 CAN0MPC *********************************************
******************************************************************************************/
#define SYSCTL_CAN0_MPC    ((CAN0_MPC_t*) (SYSCTL_BASE + CAN0_MPC_OFFSET))
#define SYSCTL_CAN0_MPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + CAN0_MPC_OFFSET)))

/******************************************************************************************
************************************38 CAN1PDS *********************************************
******************************************************************************************/
#define SYSCTL_CAN1_PDS    ((CAN1_PDS_t*) (SYSCTL_BASE + CAN1_PDS_OFFSET))
#define SYSCTL_CAN1_PDS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + CAN1_PDS_OFFSET)))

/******************************************************************************************
************************************39 CAN1MPC *********************************************
******************************************************************************************/
#define SYSCTL_CAN1_MPC    ((CAN1_MPC_t*) (SYSCTL_BASE + CAN1_MPC_OFFSET))
#define SYSCTL_CAN1_MPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + CAN1_MPC_OFFSET)))




/******************************************************************************************
************************************40 PPWD *********************************************
******************************************************************************************/
#define SYSCTL_PPWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_PPWD_OFFSET))
#define SYSCTL_PPWD_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPWD_OFFSET)))

/******************************************************************************************
************************************41 PPTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PPTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_PPTIMER_OFFSET))
#define SYSCTL_PPTIMER_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPTIMER_OFFSET)))

/******************************************************************************************
************************************42 PPGPIO *********************************************
******************************************************************************************/
#define SYSCTL_PPGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_PPGPIO_OFFSET))
#define SYSCTL_PPGPIO_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPGPIO_OFFSET)))

/******************************************************************************************
************************************43 PPDMA *********************************************
******************************************************************************************/
#define SYSCTL_PPDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_PPDMA_OFFSET))
#define SYSCTL_PPDMA_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPDMA_OFFSET)))

/******************************************************************************************
************************************44 PPEPI *********************************************
******************************************************************************************/
#define SYSCTL_PPEPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_PPEPI_OFFSET))
#define SYSCTL_PPEPI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPEPI_OFFSET)))

/******************************************************************************************
************************************45 PPHIB *********************************************
******************************************************************************************/
#define SYSCTL_PPHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_PPHIB_OFFSET))
#define SYSCTL_PPHIB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPHIB_OFFSET)))

/******************************************************************************************
************************************46 PPUART *********************************************
******************************************************************************************/
#define SYSCTL_PPUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_PPUART_OFFSET))
#define SYSCTL_PPUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PPUART_OFFSET)))

/******************************************************************************************
************************************47 PPSSI *********************************************
******************************************************************************************/
#define SYSCTL_PPSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_PPSSI_OFFSET))
#define SYSCTL_PPSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PPSSI_OFFSET)))

/******************************************************************************************
************************************48 PPI2C *********************************************
******************************************************************************************/
#define SYSCTL_PPI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_PPI2C_OFFSET))
#define SYSCTL_PPI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PPI2C_OFFSET)))

/******************************************************************************************
************************************49 PPUSB *********************************************
******************************************************************************************/
#define SYSCTL_PPUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_PPUSB_OFFSET))
#define SYSCTL_PPUSB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPUSB_OFFSET)))

/******************************************************************************************
************************************50 PPEPHY *********************************************
******************************************************************************************/
#define SYSCTL_PPEPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_PPEPHY_OFFSET))
#define SYSCTL_PPEPHY_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPEPHY_OFFSET)))

/******************************************************************************************
************************************51 PPCAN *********************************************
******************************************************************************************/
#define SYSCTL_PPCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_PPCAN_OFFSET))
#define SYSCTL_PPCAN_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPCAN_OFFSET)))

