LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/******************************************************************************************
************************************52 PPADC *********************************************
******************************************************************************************/
#define SYSCTL_PPADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_PPADC_OFFSET))
#define SYSCTL_PPADC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPADC_OFFSET)))

/******************************************************************************************
************************************53 PPACMP *********************************************
******************************************************************************************/
#define SYSCTL_PPACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_PPACMP_OFFSET))
#define SYSCTL_PPACMP_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPACMP_OFFSET)))

/****************************************************************************************
************************************54 PPPWM *********************************************
******************************************************************************************/
#define SYSCTL_PPPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_PPPWM_OFFSET))
#define SYSCTL_PPPWM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPPWM_OFFSET)))

/******************************************************************************************
************************************55 PPQEI *********************************************
******************************************************************************************/
#define SYSCTL_PPQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_PPQEI_OFFSET))
#define SYSCTL_PPQEI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPQEI_OFFSET)))

/******************************************************************************************
************************************56 PPLPC *********************************************
******************************************************************************************/
#define SYSCTL_PPLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_PPLPC_OFFSET))
#define SYSCTL_PPLPC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPLPC_OFFSET)))

/******************************************************************************************
************************************57 PPPECI *********************************************
******************************************************************************************/
#define SYSCTL_PPPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_PPPECI_OFFSET))
#define SYSCTL_PPPECI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPPECI_OFFSET)))

/******************************************************************************************
************************************58 PPFAN *********************************************
******************************************************************************************/
#define SYSCTL_PPFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_PPFAN_OFFSET))
#define SYSCTL_PPFAN_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPFAN_OFFSET)))

/******************************************************************************************
************************************59 PPEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_PPEEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_PPEEPROM_OFFSET))
#define SYSCTL_PPEEPROM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPEEPROM_OFFSET)))

/**********************************************************************************
************************************60 PPWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PPWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_PPWTIMER_OFFSET))
#define SYSCTL_PPWTIMER_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPWTIMER_OFFSET)))

/**********************************************************************************
************************************61 PPRTS *********************************************
******************************************************************************************/
#define SYSCTL_PPRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_PPRTS_OFFSET))
#define SYSCTL_PPRTS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPRTS_OFFSET)))

/**********************************************************************************
************************************62 PPCCM *********************************************
******************************************************************************************/
#define SYSCTL_PPCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_PPCCM_OFFSET))
#define SYSCTL_PPCCM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPCCM_OFFSET)))

/**********************************************************************************
************************************63 PPLCD *********************************************
******************************************************************************************/
#define SYSCTL_PPLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_PPLCD_OFFSET))
#define SYSCTL_PPLCD_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPLCD_OFFSET)))

/**********************************************************************************
************************************64 PPOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_PPOWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_PPOWIRE_OFFSET))
#define SYSCTL_PPOWIRE_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPOWIRE_OFFSET)))

/**********************************************************************************
************************************65 PPEMAC *********************************************
******************************************************************************************/
#define SYSCTL_PPEMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_PPEMAC_OFFSET))
#define SYSCTL_PPEMAC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPEMAC_OFFSET)))

/**********************************************************************************
************************************66 PPPRB *********************************************
******************************************************************************************/
#define SYSCTL_PPPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_PPPRB_OFFSET))
#define SYSCTL_PPPRB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPPRB_OFFSET)))

/**********************************************************************************
************************************67 PPHIM *********************************************
******************************************************************************************/
#define SYSCTL_PPHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_PPHIM_OFFSET))
#define SYSCTL_PPHIM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PPHIM_OFFSET)))



/******************************************************************************************
************************************68 SRWD *********************************************
******************************************************************************************/
#define SYSCTL_SRWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_SRWD_OFFSET))
#define SYSCTL_SRWD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRWD_OFFSET)))

/******************************************************************************************
************************************69 SRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_SRTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_SRTIMER_OFFSET))
#define SYSCTL_SRTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRTIMER_OFFSET)))

/******************************************************************************************
************************************70 SRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_SRGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_SRGPIO_OFFSET))
#define SYSCTL_SRGPIO_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRGPIO_OFFSET)))

/******************************************************************************************
************************************71 SRDMA *********************************************
******************************************************************************************/
#define SYSCTL_SRDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_SRDMA_OFFSET))
#define SYSCTL_SRDMA_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRDMA_OFFSET)))

/******************************************************************************************
************************************72 SREPI *********************************************
******************************************************************************************/
#define SYSCTL_SREPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_SREPI_OFFSET))
#define SYSCTL_SREPI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SREPI_OFFSET)))

/******************************************************************************************
************************************73 SRHIB *********************************************
******************************************************************************************/
#define SYSCTL_SRHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_SRHIB_OFFSET))
#define SYSCTL_SRHIB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRHIB_OFFSET)))

/******************************************************************************************
************************************74 SRUART *********************************************
******************************************************************************************/
#define SYSCTL_SRUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_SRUART_OFFSET))
#define SYSCTL_SRUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRUART_OFFSET)))

/******************************************************************************************
************************************75 SRSSI *********************************************
******************************************************************************************/
#define SYSCTL_SRSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_SRSSI_OFFSET))
#define SYSCTL_SRSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRSSI_OFFSET)))

/******************************************************************************************
************************************76 SRI2C *********************************************
******************************************************************************************/
#define SYSCTL_SRI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_SRI2C_OFFSET))
#define SYSCTL_SRI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRI2C_OFFSET)))

/******************************************************************************************
************************************77 SRUSB *********************************************
******************************************************************************************/
#define SYSCTL_SRUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_SRUSB_OFFSET))
#define SYSCTL_SRUSB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRUSB_OFFSET)))

/******************************************************************************************
************************************78 SREPHY *********************************************
******************************************************************************************/
#define SYSCTL_SREPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_SREPHY_OFFSET))
#define SYSCTL_SREPHY_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SREPHY_OFFSET)))

/******************************************************************************************
************************************79 SRCAN *********************************************
******************************************************************************************/
#define SYSCTL_SRCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_SRCAN_OFFSET))
#define SYSCTL_SRCAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRCAN_OFFSET)))

/******************************************************************************************
************************************80 SRADC *********************************************
******************************************************************************************/
#define SYSCTL_SRADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_SRADC_OFFSET))
#define SYSCTL_SRADC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRADC_OFFSET)))

/******************************************************************************************
************************************81 SRACMP *********************************************
******************************************************************************************/
#define SYSCTL_SRACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_SRACMP_OFFSET))
#define SYSCTL_SRACMP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRACMP_OFFSET)))

/****************************************************************************************
************************************82 SRPWM *********************************************
******************************************************************************************/
#define SYSCTL_SRPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_SRPWM_OFFSET))
#define SYSCTL_SRPWM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRPWM_OFFSET)))

/******************************************************************************************
************************************83 SRQEI *********************************************
******************************************************************************************/
#define SYSCTL_SRQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_SRQEI_OFFSET))
#define SYSCTL_SRQEI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRQEI_OFFSET)))

/******************************************************************************************
************************************84 SRLPC *********************************************
******************************************************************************************/
#define SYSCTL_SRLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_SRLPC_OFFSET))
#define SYSCTL_SRLPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRLPC_OFFSET)))

/******************************************************************************************
************************************85 SRPECI *********************************************
******************************************************************************************/
#define SYSCTL_SRPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_SRPECI_OFFSET))
#define SYSCTL_SRPECI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRPECI_OFFSET)))

/******************************************************************************************
************************************86 SRFAN *********************************************
******************************************************************************************/
#define SYSCTL_SRFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_SRFAN_OFFSET))
#define SYSCTL_SRFAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRFAN_OFFSET)))

/******************************************************************************************
************************************87 SREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_SREEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_SREEPROM_OFFSET))
#define SYSCTL_SREEPROM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SREEPROM_OFFSET)))

/**********************************************************************************
************************************88 SRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_SRWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_SRWTIMER_OFFSET))
#define SYSCTL_SRWTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRWTIMER_OFFSET)))

/**********************************************************************************
************************************89 SRRTS *********************************************
******************************************************************************************/
#define SYSCTL_SRRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_SRRTS_OFFSET))
#define SYSCTL_SRRTS_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRRTS_OFFSET)))

/**********************************************************************************
************************************90 SRCCM *********************************************
******************************************************************************************/
#define SYSCTL_SRCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_SRCCM_OFFSET))
#define SYSCTL_SRCCM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRCCM_OFFSET)))

/**********************************************************************************
************************************91 SRLCD *********************************************
******************************************************************************************/
#define SYSCTL_SRLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_SRLCD_OFFSET))
#define SYSCTL_SRLCD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRLCD_OFFSET)))

/**********************************************************************************
************************************92 SROWIRE *********************************************
******************************************************************************************/
#define SYSCTL_SROWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_SROWIRE_OFFSET))
#define SYSCTL_SROWIRE_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SROWIRE_OFFSET)))

/**********************************************************************************
************************************93 SREMAC *********************************************
******************************************************************************************/
#define SYSCTL_SREMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_SREMAC_OFFSET))
#define SYSCTL_SREMAC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SREMAC_OFFSET)))

/**********************************************************************************
************************************94 SRPRB *********************************************
******************************************************************************************/
#define SYSCTL_SRPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_SRPRB_OFFSET))
#define SYSCTL_SRPRB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRPRB_OFFSET)))

/**********************************************************************************
************************************95 SRHIM *********************************************
******************************************************************************************/
#define SYSCTL_SRHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_SRHIM_OFFSET))
#define SYSCTL_SRHIM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SRHIM_OFFSET)))



/******************************************************************************************
************************************96 RCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_RCGCWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_RCGCWD_OFFSET))
#define SYSCTL_RCGCWD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCWD_OFFSET)))

/******************************************************************************************
************************************97 RCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_RCGCTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_RCGCTIMER_OFFSET))
#define SYSCTL_RCGCTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCTIMER_OFFSET)))

/******************************************************************************************
************************************98 RCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_RCGCGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_RCGCGPIO_OFFSET))
#define SYSCTL_RCGCGPIO_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCGPIO_OFFSET)))

/******************************************************************************************
************************************99 RCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_RCGCDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_RCGCDMA_OFFSET))
#define SYSCTL_RCGCDMA_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCDMA_OFFSET)))

/******************************************************************************************
************************************100 RCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_RCGCEPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_RCGCEPI_OFFSET))
#define SYSCTL_RCGCEPI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCEPI_OFFSET)))

/******************************************************************************************
************************************101 RCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_RCGCHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_RCGCHIB_OFFSET))
#define SYSCTL_RCGCHIB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCHIB_OFFSET)))

/******************************************************************************************
************************************102 RCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_RCGCUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_RCGCUART_OFFSET))
#define SYSCTL_RCGCUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCUART_OFFSET)))

/******************************************************************************************
************************************103 RCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_RCGCSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_RCGCSSI_OFFSET))
#define SYSCTL_RCGCSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCSSI_OFFSET)))

/******************************************************************************************
************************************104 RCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_RCGCI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_RCGCI2C_OFFSET))
#define SYSCTL_RCGCI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCI2C_OFFSET)))

