LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/******************************************************************************************
************************************105 RCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_RCGCUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_RCGCUSB_OFFSET))
#define SYSCTL_RCGCUSB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCUSB_OFFSET)))

/******************************************************************************************
************************************106 RCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_RCGCEPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_RCGCEPHY_OFFSET))
#define SYSCTL_RCGCEPHY_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCEPHY_OFFSET)))

/******************************************************************************************
************************************107 RCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_RCGCCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_RCGCCAN_OFFSET))
#define SYSCTL_RCGCCAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCCAN_OFFSET)))

/******************************************************************************************
************************************108 RCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_RCGCADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_RCGCADC_OFFSET))
#define SYSCTL_RCGCADC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCADC_OFFSET)))

/******************************************************************************************
************************************109 RCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_RCGCACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_RCGCACMP_OFFSET))
#define SYSCTL_RCGCACMP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCACMP_OFFSET)))

/****************************************************************************************
************************************110 RCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_RCGCPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_RCGCPWM_OFFSET))
#define SYSCTL_RCGCPWM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCPWM_OFFSET)))

/******************************************************************************************
************************************111 RCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_RCGCQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_RCGCQEI_OFFSET))
#define SYSCTL_RCGCQEI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCQEI_OFFSET)))

/******************************************************************************************
************************************112 RCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_RCGCLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_RCGCLPC_OFFSET))
#define SYSCTL_RCGCLPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCLPC_OFFSET)))

/******************************************************************************************
************************************113 RCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_RCGCPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_RCGCPECI_OFFSET))
#define SYSCTL_RCGCPECI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCPECI_OFFSET)))

/******************************************************************************************
************************************114 RCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_RCGCFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_RCGCFAN_OFFSET))
#define SYSCTL_RCGCFAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCFAN_OFFSET)))

/******************************************************************************************
************************************115 RCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_RCGCEEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_RCGCEEPROM_OFFSET))
#define SYSCTL_RCGCEEPROM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCEEPROM_OFFSET)))

/**********************************************************************************
************************************116 RCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_RCGCWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_RCGCWTIMER_OFFSET))
#define SYSCTL_RCGCWTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCWTIMER_OFFSET)))

/**********************************************************************************
************************************117 RCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_RCGCRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_RCGCRTS_OFFSET))
#define SYSCTL_RCGCRTS_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCRTS_OFFSET)))

/**********************************************************************************
************************************118 RCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_RCGCCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_RCGCCCM_OFFSET))
#define SYSCTL_RCGCCCM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCCCM_OFFSET)))

/**********************************************************************************
************************************119 RCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_RCGCLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_RCGCLCD_OFFSET))
#define SYSCTL_RCGCLCD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCLCD_OFFSET)))

/**********************************************************************************
************************************120 RCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_RCGCOWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_RCGCOWIRE_OFFSET))
#define SYSCTL_RCGCOWIRE_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCOWIRE_OFFSET)))

/**********************************************************************************
************************************121 RCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_RCGCEMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_RCGCEMAC_OFFSET))
#define SYSCTL_RCGCEMAC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCEMAC_OFFSET)))

/**********************************************************************************
************************************122 RCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_RCGCPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_RCGCPRB_OFFSET))
#define SYSCTL_RCGCPRB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCPRB_OFFSET)))

/**********************************************************************************
************************************123 RCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_RCGCHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_RCGCHIM_OFFSET))
#define SYSCTL_RCGCHIM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RCGCHIM_OFFSET)))




/******************************************************************************************
************************************124 SCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_SCGCWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_SCGCWD_OFFSET))
#define SYSCTL_SCGCWD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCWD_OFFSET)))

/******************************************************************************************
************************************125 SCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_SCGCTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_SCGCTIMER_OFFSET))
#define SYSCTL_SCGCTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCTIMER_OFFSET)))

/******************************************************************************************
************************************126 SCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_SCGCGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_SCGCGPIO_OFFSET))
#define SYSCTL_SCGCGPIO_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCGPIO_OFFSET)))

/******************************************************************************************
************************************127 SCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_SCGCDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_SCGCDMA_OFFSET))
#define SYSCTL_SCGCDMA_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCDMA_OFFSET)))

/******************************************************************************************
************************************128 SCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_SCGCEPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_SCGCEPI_OFFSET))
#define SYSCTL_SCGCEPI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCEPI_OFFSET)))

/******************************************************************************************
************************************129 SCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_SCGCHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_SCGCHIB_OFFSET))
#define SYSCTL_SCGCHIB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCHIB_OFFSET)))

/******************************************************************************************
************************************130 SCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_SCGCUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_SCGCUART_OFFSET))
#define SYSCTL_SCGCUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCUART_OFFSET)))

/******************************************************************************************
************************************131 SCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_SCGCSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_SCGCSSI_OFFSET))
#define SYSCTL_SCGCSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCSSI_OFFSET)))

/******************************************************************************************
************************************132 SCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_SCGCI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_SCGCI2C_OFFSET))
#define SYSCTL_SCGCI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCI2C_OFFSET)))

/******************************************************************************************
************************************133 SCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_SCGCUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_SCGCUSB_OFFSET))
#define SYSCTL_SCGCUSB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCUSB_OFFSET)))

/******************************************************************************************
************************************134 SCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_SCGCEPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_SCGCEPHY_OFFSET))
#define SYSCTL_SCGCEPHY_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCEPHY_OFFSET)))

/******************************************************************************************
************************************135 SCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_SCGCCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_SCGCCAN_OFFSET))
#define SYSCTL_SCGCCAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCCAN_OFFSET)))

/******************************************************************************************
************************************136 SCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_SCGCADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_SCGCADC_OFFSET))
#define SYSCTL_SCGCADC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCADC_OFFSET)))

/******************************************************************************************
************************************137 SCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_SCGCACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_SCGCACMP_OFFSET))
#define SYSCTL_SCGCACMP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCACMP_OFFSET)))

/****************************************************************************************
************************************138 SCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_SCGCPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_SCGCPWM_OFFSET))
#define SYSCTL_SCGCPWM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCPWM_OFFSET)))

/******************************************************************************************
************************************139 SCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_SCGCQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_SCGCQEI_OFFSET))
#define SYSCTL_SCGCQEI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCQEI_OFFSET)))

/******************************************************************************************
************************************140 SCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_SCGCLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_SCGCLPC_OFFSET))
#define SYSCTL_SCGCLPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCLPC_OFFSET)))

/******************************************************************************************
************************************141 SCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_SCGCPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_SCGCPECI_OFFSET))
#define SYSCTL_SCGCPECI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCPECI_OFFSET)))

/******************************************************************************************
************************************142 SCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_SCGCFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_SCGCFAN_OFFSET))
#define SYSCTL_SCGCFAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCFAN_OFFSET)))

/******************************************************************************************
************************************143 SCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_SCGCEEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_SCGCEEPROM_OFFSET))
#define SYSCTL_SCGCEEPROM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCEEPROM_OFFSET)))

/**********************************************************************************
************************************144 SCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_SCGCWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_SCGCWTIMER_OFFSET))
#define SYSCTL_SCGCWTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCWTIMER_OFFSET)))

/**********************************************************************************
************************************145 SCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_SCGCRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_SCGCRTS_OFFSET))
#define SYSCTL_SCGCRTS_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCRTS_OFFSET)))

/**********************************************************************************
************************************146 SCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_SCGCCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_SCGCCCM_OFFSET))
#define SYSCTL_SCGCCCM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCCCM_OFFSET)))

/**********************************************************************************
************************************147 SCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_SCGCLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_SCGCLCD_OFFSET))
#define SYSCTL_SCGCLCD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCLCD_OFFSET)))

/**********************************************************************************
************************************148 SCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_SCGCOWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_SCGCOWIRE_OFFSET))
#define SYSCTL_SCGCOWIRE_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCOWIRE_OFFSET)))

/**********************************************************************************
************************************149 SCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_SCGCEMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_SCGCEMAC_OFFSET))
#define SYSCTL_SCGCEMAC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCEMAC_OFFSET)))

/**********************************************************************************
************************************150 SCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_SCGCPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_SCGCPRB_OFFSET))
#define SYSCTL_SCGCPRB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCPRB_OFFSET)))

/**********************************************************************************
************************************151 SCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_SCGCHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_SCGCHIM_OFFSET))
#define SYSCTL_SCGCHIM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_SCGCHIM_OFFSET)))




/******************************************************************************************
************************************152 DCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_DCGCWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_DCGCWD_OFFSET))
#define SYSCTL_DCGCWD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCWD_OFFSET)))

/******************************************************************************************
************************************153 DCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_DCGCTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_DCGCTIMER_OFFSET))
#define SYSCTL_DCGCTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCTIMER_OFFSET)))

/******************************************************************************************
************************************154 DCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_DCGCGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_DCGCGPIO_OFFSET))
#define SYSCTL_DCGCGPIO_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCGPIO_OFFSET)))

/******************************************************************************************
************************************155 DCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_DCGCDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_DCGCDMA_OFFSET))
#define SYSCTL_DCGCDMA_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCDMA_OFFSET)))

/******************************************************************************************
************************************156 DCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_DCGCEPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_DCGCEPI_OFFSET))
#define SYSCTL_DCGCEPI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCEPI_OFFSET)))

