LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/******************************************************************************************
************************************157 DCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_DCGCHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_DCGCHIB_OFFSET))
#define SYSCTL_DCGCHIB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCHIB_OFFSET)))

/******************************************************************************************
************************************158 DCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_DCGCUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_DCGCUART_OFFSET))
#define SYSCTL_DCGCUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCUART_OFFSET)))

/******************************************************************************************
************************************159 DCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_DCGCSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_DCGCSSI_OFFSET))
#define SYSCTL_DCGCSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCSSI_OFFSET)))

/******************************************************************************************
************************************160 DCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_DCGCI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_DCGCI2C_OFFSET))
#define SYSCTL_DCGCI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCI2C_OFFSET)))

/******************************************************************************************
************************************161 DCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_DCGCUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_DCGCUSB_OFFSET))
#define SYSCTL_DCGCUSB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCUSB_OFFSET)))

/******************************************************************************************
************************************162 DCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_DCGCEPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_DCGCEPHY_OFFSET))
#define SYSCTL_DCGCEPHY_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCEPHY_OFFSET)))

/******************************************************************************************
************************************163 DCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_DCGCCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_DCGCCAN_OFFSET))
#define SYSCTL_DCGCCAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCCAN_OFFSET)))

/******************************************************************************************
************************************164 DCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_DCGCADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_DCGCADC_OFFSET))
#define SYSCTL_DCGCADC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCADC_OFFSET)))

/******************************************************************************************
************************************165 DCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_DCGCACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_DCGCACMP_OFFSET))
#define SYSCTL_DCGCACMP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCACMP_OFFSET)))

/****************************************************************************************
************************************166 DCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_DCGCPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_DCGCPWM_OFFSET))
#define SYSCTL_DCGCPWM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCPWM_OFFSET)))

/******************************************************************************************
************************************167 DCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_DCGCQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_DCGCQEI_OFFSET))
#define SYSCTL_DCGCQEI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCQEI_OFFSET)))

/******************************************************************************************
************************************168 DCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_DCGCLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_DCGCLPC_OFFSET))
#define SYSCTL_DCGCLPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCLPC_OFFSET)))

/******************************************************************************************
************************************169 DCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_DCGCPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_DCGCPECI_OFFSET))
#define SYSCTL_DCGCPECI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCPECI_OFFSET)))

/******************************************************************************************
************************************170 DCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_DCGCFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_DCGCFAN_OFFSET))
#define SYSCTL_DCGCFAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCFAN_OFFSET)))

/******************************************************************************************
************************************171 DCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_DCGCEEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_DCGCEEPROM_OFFSET))
#define SYSCTL_DCGCEEPROM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCEEPROM_OFFSET)))

/**********************************************************************************
************************************172 DCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_DCGCWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_DCGCWTIMER_OFFSET))
#define SYSCTL_DCGCWTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCWTIMER_OFFSET)))

/**********************************************************************************
************************************173 DCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_DCGCRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_DCGCRTS_OFFSET))
#define SYSCTL_DCGCRTS_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCRTS_OFFSET)))

/**********************************************************************************
************************************174 DCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_DCGCCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_DCGCCCM_OFFSET))
#define SYSCTL_DCGCCCM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCCCM_OFFSET)))

/**********************************************************************************
************************************175 DCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_DCGCLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_DCGCLCD_OFFSET))
#define SYSCTL_DCGCLCD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCLCD_OFFSET)))

/**********************************************************************************
************************************176 DCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_DCGCOWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_DCGCOWIRE_OFFSET))
#define SYSCTL_DCGCOWIRE_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCOWIRE_OFFSET)))

/**********************************************************************************
************************************177 DCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_DCGCEMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_DCGCEMAC_OFFSET))
#define SYSCTL_DCGCEMAC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCEMAC_OFFSET)))

/**********************************************************************************
************************************178 DCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_DCGCPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_DCGCPRB_OFFSET))
#define SYSCTL_DCGCPRB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCPRB_OFFSET)))

/**********************************************************************************
************************************179 DCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_DCGCHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_DCGCHIM_OFFSET))
#define SYSCTL_DCGCHIM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_DCGCHIM_OFFSET)))




/******************************************************************************************
************************************180 PCWD *********************************************
******************************************************************************************/
#define SYSCTL_PCWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_PCWD_OFFSET))
#define SYSCTL_PCWD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCWD_OFFSET)))

/******************************************************************************************
************************************181 PCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PCTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_PCTIMER_OFFSET))
#define SYSCTL_PCTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCTIMER_OFFSET)))

/******************************************************************************************
************************************182 PCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_PCGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_PCGPIO_OFFSET))
#define SYSCTL_PCGPIO_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCGPIO_OFFSET)))

/******************************************************************************************
************************************183 PCDMA *********************************************
******************************************************************************************/
#define SYSCTL_PCDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_PCDMA_OFFSET))
#define SYSCTL_PCDMA_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCDMA_OFFSET)))

/******************************************************************************************
************************************184 PCEPI *********************************************
******************************************************************************************/
#define SYSCTL_PCEPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_PCEPI_OFFSET))
#define SYSCTL_PCEPI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCEPI_OFFSET)))

/******************************************************************************************
************************************185 PCHIB *********************************************
******************************************************************************************/
#define SYSCTL_PCHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_PCHIB_OFFSET))
#define SYSCTL_PCHIB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCHIB_OFFSET)))

/******************************************************************************************
************************************186 PCUART *********************************************
******************************************************************************************/
#define SYSCTL_PCUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_PCUART_OFFSET))
#define SYSCTL_PCUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCUART_OFFSET)))

/******************************************************************************************
************************************187 PCSSI *********************************************
******************************************************************************************/
#define SYSCTL_PCSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_PCSSI_OFFSET))
#define SYSCTL_PCSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCSSI_OFFSET)))

/******************************************************************************************
************************************188 PCI2C *********************************************
******************************************************************************************/
#define SYSCTL_PCI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_PCI2C_OFFSET))
#define SYSCTL_PCI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCI2C_OFFSET)))

/******************************************************************************************
************************************189 PCUSB *********************************************
******************************************************************************************/
#define SYSCTL_PCUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_PCUSB_OFFSET))
#define SYSCTL_PCUSB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCUSB_OFFSET)))

/******************************************************************************************
************************************190 PCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_PCEPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_PCEPHY_OFFSET))
#define SYSCTL_PCEPHY_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCEPHY_OFFSET)))

/******************************************************************************************
************************************191 PCCAN *********************************************
******************************************************************************************/
#define SYSCTL_PCCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_PCCAN_OFFSET))
#define SYSCTL_PCCAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCCAN_OFFSET)))

/******************************************************************************************
************************************192 PCADC *********************************************
******************************************************************************************/
#define SYSCTL_PCADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_PCADC_OFFSET))
#define SYSCTL_PCADC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCADC_OFFSET)))

/******************************************************************************************
************************************193 PCACMP *********************************************
******************************************************************************************/
#define SYSCTL_PCACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_PCACMP_OFFSET))
#define SYSCTL_PCACMP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCACMP_OFFSET)))

/****************************************************************************************
************************************194 PCPWM *********************************************
******************************************************************************************/
#define SYSCTL_PCPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_PCPWM_OFFSET))
#define SYSCTL_PCPWM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCPWM_OFFSET)))

/******************************************************************************************
************************************195 PCQEI *********************************************
******************************************************************************************/
#define SYSCTL_PCQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_PCQEI_OFFSET))
#define SYSCTL_PCQEI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCQEI_OFFSET)))

/******************************************************************************************
************************************196 PCLPC *********************************************
******************************************************************************************/
#define SYSCTL_PCLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_PCLPC_OFFSET))
#define SYSCTL_PCLPC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCLPC_OFFSET)))

/******************************************************************************************
************************************197 PCPECI *********************************************
******************************************************************************************/
#define SYSCTL_PCPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_PCPECI_OFFSET))
#define SYSCTL_PCPECI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCPECI_OFFSET)))

/******************************************************************************************
************************************198 PCFAN *********************************************
******************************************************************************************/
#define SYSCTL_PCFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_PCFAN_OFFSET))
#define SYSCTL_PCFAN_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCFAN_OFFSET)))

/******************************************************************************************
************************************199 PCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_PCEEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_PCEEPROM_OFFSET))
#define SYSCTL_PCEEPROM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCEEPROM_OFFSET)))

/**********************************************************************************
************************************200 PCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PCWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_PCWTIMER_OFFSET))
#define SYSCTL_PCWTIMER_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCWTIMER_OFFSET)))

/**********************************************************************************
************************************201 PCRTS *********************************************
******************************************************************************************/
#define SYSCTL_PCRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_PCRTS_OFFSET))
#define SYSCTL_PCRTS_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCRTS_OFFSET)))

/**********************************************************************************
************************************202 PCCCM *********************************************
******************************************************************************************/
#define SYSCTL_PCCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_PCCCM_OFFSET))
#define SYSCTL_PCCCM_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCCCM_OFFSET)))

/**********************************************************************************
************************************203 PCLCD *********************************************
******************************************************************************************/
#define SYSCTL_PCLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_PCLCD_OFFSET))
#define SYSCTL_PCLCD_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCLCD_OFFSET)))

/**********************************************************************************
************************************204 PCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_PCOWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_PCOWIRE_OFFSET))
#define SYSCTL_PCOWIRE_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCOWIRE_OFFSET)))

/**********************************************************************************
************************************205 PCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_PCEMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_PCEMAC_OFFSET))
#define SYSCTL_PCEMAC_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCEMAC_OFFSET)))

/**********************************************************************************
************************************206 PCPRB *********************************************
******************************************************************************************/
#define SYSCTL_PCPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_PCPRB_OFFSET))
#define SYSCTL_PCPRB_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PCPRB_OFFSET)))

/**********************************************************************************
************************************207 PCHIM *********************************************
******************************************************************************************/
#define SYSCTL_PCHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_PCHIM_OFFSET))
#define SYSCTL_PCHIM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PCHIM_OFFSET)))




/******************************************************************************************
************************************208 PRWD *********************************************
******************************************************************************************/
#define SYSCTL_PRWD    ((PERIPHERAL_WD_t*) (SYSCTL_BASE + SYSCTL_PRWD_OFFSET))
#define SYSCTL_PRWD_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRWD_OFFSET)))

/******************************************************************************************
************************************209 PRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PRTIMER    ((PERIPHERAL_TIMER_t*) (SYSCTL_BASE + SYSCTL_PRTIMER_OFFSET))
#define SYSCTL_PRTIMER_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRTIMER_OFFSET)))

