LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/******************************************************************************************
************************************210 PRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_PRGPIO    ((PERIPHERAL_GPIO_t*) (SYSCTL_BASE + SYSCTL_PRGPIO_OFFSET))
#define SYSCTL_PRGPIO_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRGPIO_OFFSET)))

/******************************************************************************************
************************************211 PRDMA *********************************************
******************************************************************************************/
#define SYSCTL_PRDMA    ((PERIPHERAL_DMA_t*) (SYSCTL_BASE + SYSCTL_PRDMA_OFFSET))
#define SYSCTL_PRDMA_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRDMA_OFFSET)))

/******************************************************************************************
************************************212 PREPI *********************************************
******************************************************************************************/
#define SYSCTL_PREPI    ((PERIPHERAL_EPI_t*) (SYSCTL_BASE + SYSCTL_PREPI_OFFSET))
#define SYSCTL_PREPI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PREPI_OFFSET)))

/******************************************************************************************
************************************213 PRHIB *********************************************
******************************************************************************************/
#define SYSCTL_PRHIB    ((PERIPHERAL_HIB_t*) (SYSCTL_BASE + SYSCTL_PRHIB_OFFSET))
#define SYSCTL_PRHIB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRHIB_OFFSET)))

/******************************************************************************************
************************************214 PRUART *********************************************
******************************************************************************************/
#define SYSCTL_PRUART    ((PERIPHERAL_UART_t*) (SYSCTL_BASE + SYSCTL_PRUART_OFFSET))
#define SYSCTL_PRUART_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PRUART_OFFSET)))

/******************************************************************************************
************************************215 PRSSI *********************************************
******************************************************************************************/
#define SYSCTL_PRSSI    ((PERIPHERAL_SSI_t*) (SYSCTL_BASE + SYSCTL_PRSSI_OFFSET))
#define SYSCTL_PRSSI_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PRSSI_OFFSET)))

/******************************************************************************************
************************************216 PRI2C *********************************************
******************************************************************************************/
#define SYSCTL_PRI2C    ((PERIPHERAL_I2C_t*) (SYSCTL_BASE + SYSCTL_PRI2C_OFFSET))
#define SYSCTL_PRI2C_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_PRI2C_OFFSET)))

/******************************************************************************************
************************************217 PRUSB *********************************************
******************************************************************************************/
#define SYSCTL_PRUSB    ((PERIPHERAL_USB_t*) (SYSCTL_BASE + SYSCTL_PRUSB_OFFSET))
#define SYSCTL_PRUSB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRUSB_OFFSET)))

/******************************************************************************************
************************************218 PREPHY *********************************************
******************************************************************************************/
#define SYSCTL_PREPHY    ((PERIPHERAL_EPHY_t*) (SYSCTL_BASE + SYSCTL_PREPHY_OFFSET))
#define SYSCTL_PREPHY_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PREPHY_OFFSET)))

/******************************************************************************************
************************************219 PRCAN *********************************************
******************************************************************************************/
#define SYSCTL_PRCAN    ((PERIPHERAL_CAN_t*) (SYSCTL_BASE + SYSCTL_PRCAN_OFFSET))
#define SYSCTL_PRCAN_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRCAN_OFFSET)))

/******************************************************************************************
************************************220 PRADC *********************************************
******************************************************************************************/
#define SYSCTL_PRADC    ((PERIPHERAL_ADC_t*) (SYSCTL_BASE + SYSCTL_PRADC_OFFSET))
#define SYSCTL_PRADC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRADC_OFFSET)))

/******************************************************************************************
************************************221 PRACMP *********************************************
******************************************************************************************/
#define SYSCTL_PRACMP    ((PERIPHERAL_ACMP_t*) (SYSCTL_BASE + SYSCTL_PRACMP_OFFSET))
#define SYSCTL_PRACMP_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRACMP_OFFSET)))

/****************************************************************************************
************************************222 PRPWM *********************************************
******************************************************************************************/
#define SYSCTL_PRPWM    ((PERIPHERAL_PWM_t*) (SYSCTL_BASE + SYSCTL_PRPWM_OFFSET))
#define SYSCTL_PRPWM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRPWM_OFFSET)))

/******************************************************************************************
************************************223 PRQEI *********************************************
******************************************************************************************/
#define SYSCTL_PRQEI    ((PERIPHERAL_QEI_t*) (SYSCTL_BASE + SYSCTL_PRQEI_OFFSET))
#define SYSCTL_PRQEI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRQEI_OFFSET)))

/******************************************************************************************
************************************224 PRLPC *********************************************
******************************************************************************************/
#define SYSCTL_PRLPC    ((PERIPHERAL_LPC_t*) (SYSCTL_BASE + SYSCTL_PRLPC_OFFSET))
#define SYSCTL_PRLPC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRLPC_OFFSET)))

/******************************************************************************************
************************************225 PRPECI *********************************************
******************************************************************************************/
#define SYSCTL_PRPECI    ((PERIPHERAL_PECI_t*) (SYSCTL_BASE + SYSCTL_PRPECI_OFFSET))
#define SYSCTL_PRPECI_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRPECI_OFFSET)))

/******************************************************************************************
************************************226 PRFAN *********************************************
******************************************************************************************/
#define SYSCTL_PRFAN    ((PERIPHERAL_FAN_t*) (SYSCTL_BASE + SYSCTL_PRFAN_OFFSET))
#define SYSCTL_PRFAN_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRFAN_OFFSET)))

/******************************************************************************************
************************************227 PREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_PREEPROM    ((PERIPHERAL_EEPROM_t*) (SYSCTL_BASE + SYSCTL_PREEPROM_OFFSET))
#define SYSCTL_PREEPROM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PREEPROM_OFFSET)))

/**********************************************************************************
************************************228 PRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_PRWTIMER    ((PERIPHERAL_WTIMER_t*) (SYSCTL_BASE + SYSCTL_PRWTIMER_OFFSET))
#define SYSCTL_PRWTIMER_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRWTIMER_OFFSET)))

/**********************************************************************************
************************************229 PRRTS *********************************************
******************************************************************************************/
#define SYSCTL_PRRTS    ((PERIPHERAL_RTS_t*) (SYSCTL_BASE + SYSCTL_PRRTS_OFFSET))
#define SYSCTL_PRRTS_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRRTS_OFFSET)))

/**********************************************************************************
************************************230 PRCCM *********************************************
******************************************************************************************/
#define SYSCTL_PRCCM    ((PERIPHERAL_CCM_t*) (SYSCTL_BASE + SYSCTL_PRCCM_OFFSET))
#define SYSCTL_PRCCM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRCCM_OFFSET)))

/**********************************************************************************
************************************231 PRLCD *********************************************
******************************************************************************************/
#define SYSCTL_PRLCD    ((PERIPHERAL_LCD_t*) (SYSCTL_BASE + SYSCTL_PRLCD_OFFSET))
#define SYSCTL_PRLCD_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRLCD_OFFSET)))

/**********************************************************************************
************************************232 PROWIRE *********************************************
******************************************************************************************/
#define SYSCTL_PROWIRE    ((PERIPHERAL_OWIRE_t*) (SYSCTL_BASE + SYSCTL_PROWIRE_OFFSET))
#define SYSCTL_PROWIRE_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PROWIRE_OFFSET)))

/**********************************************************************************
************************************233 PREMAC *********************************************
******************************************************************************************/
#define SYSCTL_PREMAC    ((PERIPHERAL_EMAC_t*) (SYSCTL_BASE + SYSCTL_PREMAC_OFFSET))
#define SYSCTL_PREMAC_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PREMAC_OFFSET)))

/**********************************************************************************
************************************234 PRPRB *********************************************
******************************************************************************************/
#define SYSCTL_PRPRB    ((PERIPHERAL_PRB_t*) (SYSCTL_BASE + SYSCTL_PRPRB_OFFSET))
#define SYSCTL_PRPRB_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRPRB_OFFSET)))

/**********************************************************************************
************************************235 PRHIM *********************************************
******************************************************************************************/
#define SYSCTL_PRHIM    ((PERIPHERAL_HIM_t*) (SYSCTL_BASE + SYSCTL_PRHIM_OFFSET))
#define SYSCTL_PRHIM_R    (*((volatile const UBase_t*) (SYSCTL_BASE + SYSCTL_PRHIM_OFFSET)))


/**********************************************************************************
************************************236 UNIQUEID0 *********************************************
******************************************************************************************/
#define SYSCTL_UNIQUE_ID0    ((UNIQUE_ID_t*) (SYSCTL_BASE + UNIQUE_ID0_OFFSET))
#define SYSCTL_UNIQUE_ID0_R    (*((volatile const UBase_t*) (SYSCTL_BASE + UNIQUE_ID0_OFFSET)))


/**********************************************************************************
************************************237 UNIQUEID1 *********************************************
******************************************************************************************/
#define SYSCTL_UNIQUE_ID1    ((UNIQUE_ID_t*) (SYSCTL_BASE + UNIQUE_ID1_OFFSET))
#define SYSCTL_UNIQUE_ID1_R    (*((volatile const UBase_t*) (SYSCTL_BASE + UNIQUE_ID1_OFFSET)))


/**********************************************************************************
************************************238 UNIQUEID2 *********************************************
******************************************************************************************/
#define SYSCTL_UNIQUE_ID2    ((UNIQUE_ID_t*) (SYSCTL_BASE + UNIQUE_ID2_OFFSET))
#define SYSCTL_UNIQUE_ID2_R    (*((volatile const UBase_t*) (SYSCTL_BASE + UNIQUE_ID2_OFFSET)))


/**********************************************************************************
************************************239 UNIQUEID3 *********************************************
******************************************************************************************/
#define SYSCTL_UNIQUE_ID3    ((UNIQUE_ID_t*) (SYSCTL_BASE + UNIQUE_ID3_OFFSET))
#define SYSCTL_UNIQUE_ID3_R    (*((volatile const UBase_t*) (SYSCTL_BASE + UNIQUE_ID3_OFFSET)))



/******************************************************************************************
************************************ 240-Flash RVP *********************************************
******************************************************************************************/
#define SYSCTL_RVP    ((SYSCTL_RVP_t*) (SYSCTL_BASE + SYSCTL_RVP_OFFSET))
#define SYSCTL_RVP_R    (*((volatile UBase_t*) (SYSCTL_BASE + SYSCTL_RVP_OFFSET)))

/******************************************************************************************
************************************ 241-Flash FMPRE0 *********************************************
******************************************************************************************/
#define FLASH_PRE0    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE0_OFFSET))
#define FLASH_PRE0_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE0_OFFSET)))

/******************************************************************************************
************************************ 242-Flash FMPRE1 *********************************************
******************************************************************************************/
#define FLASH_PRE1    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE1_OFFSET))
#define FLASH_PRE1_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE1_OFFSET)))

/******************************************************************************************
************************************ 243-Flash FMPRE2 *********************************************
******************************************************************************************/
#define FLASH_PRE2    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE2_OFFSET))
#define FLASH_PRE2_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE2_OFFSET)))

/******************************************************************************************
************************************ 244-Flash FMPRE3 *********************************************
******************************************************************************************/
#define FLASH_PRE3    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE3_OFFSET))
#define FLASH_PRE3_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE3_OFFSET)))

/******************************************************************************************
************************************ 245-Flash FMPRE4 *********************************************
******************************************************************************************/
#define FLASH_PRE4    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE4_OFFSET))
#define FLASH_PRE4_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE4_OFFSET)))

/******************************************************************************************
************************************ 246-Flash FMPRE5 *********************************************
******************************************************************************************/
#define FLASH_PRE5    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE5_OFFSET))
#define FLASH_PRE5_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE5_OFFSET)))

/******************************************************************************************
************************************ 247-Flash FMPRE6 *********************************************
******************************************************************************************/
#define FLASH_PRE6    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE6_OFFSET))
#define FLASH_PRE6_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE6_OFFSET)))

/******************************************************************************************
************************************ 248-Flash FMPRE7 *********************************************
******************************************************************************************/
#define FLASH_PRE7    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE7_OFFSET))
#define FLASH_PRE7_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE7_OFFSET)))

/******************************************************************************************
************************************ 249-Flash FMPRE8 *********************************************
******************************************************************************************/
#define FLASH_PRE8    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE8_OFFSET))
#define FLASH_PRE8_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE8_OFFSET)))

/******************************************************************************************
************************************ 250-Flash FMPRE9 *********************************************
******************************************************************************************/
#define FLASH_PRE9    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE9_OFFSET))
#define FLASH_PRE9_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE9_OFFSET)))

/******************************************************************************************
************************************ 251-Flash FMPRE10 *********************************************
******************************************************************************************/
#define FLASH_PRE10    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE10_OFFSET))
#define FLASH_PRE10_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE10_OFFSET)))

/******************************************************************************************
************************************ 252-Flash FMPRE11 *********************************************
******************************************************************************************/
#define FLASH_PRE11    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE11_OFFSET))
#define FLASH_PRE11_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE11_OFFSET)))

/******************************************************************************************
************************************ 253-Flash FMPRE12 *********************************************
******************************************************************************************/
#define FLASH_PRE12    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE12_OFFSET))
#define FLASH_PRE12_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE12_OFFSET)))

/******************************************************************************************
************************************ 254-Flash FMPRE13 *********************************************
******************************************************************************************/
#define FLASH_PRE13    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE13_OFFSET))
#define FLASH_PRE13_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE13_OFFSET)))

/******************************************************************************************
************************************ 255-Flash FMPRE14 *********************************************
******************************************************************************************/
#define FLASH_PRE14    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE14_OFFSET))
#define FLASH_PRE14_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE14_OFFSET)))

/******************************************************************************************
************************************ 256-Flash FMPRE15 *********************************************
******************************************************************************************/
#define FLASH_PRE15    ((FLASH_PRE_t*) (SYSCTL_BASE + FLASH_PRE15_OFFSET))
#define FLASH_PRE15_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PRE15_OFFSET)))

/******************************************************************************************
************************************ 257-Flash FMPPE0 *********************************************
******************************************************************************************/
#define FLASH_PPE0    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE0_OFFSET))
#define FLASH_PPE0_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE0_OFFSET)))

/******************************************************************************************
************************************ 258-Flash FMPPE1 *********************************************
******************************************************************************************/
#define FLASH_PPE1    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE1_OFFSET))
#define FLASH_PPE1_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE1_OFFSET)))

/******************************************************************************************
************************************ 259-Flash FMPPE2 *********************************************
******************************************************************************************/
#define FLASH_PPE2    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE2_OFFSET))
#define FLASH_PPE2_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE2_OFFSET)))

/******************************************************************************************
************************************ 260-Flash FMPPE3 *********************************************
******************************************************************************************/
#define FLASH_PPE3    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE3_OFFSET))
#define FLASH_PPE3_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE3_OFFSET)))

/******************************************************************************************
************************************ 261-Flash FMPPE4 *********************************************
******************************************************************************************/
#define FLASH_PPE4    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE4_OFFSET))
#define FLASH_PPE4_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE4_OFFSET)))

/******************************************************************************************
************************************ 262-Flash FMPPE5 *********************************************
******************************************************************************************/
#define FLASH_PPE5    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE5_OFFSET))
#define FLASH_PPE5_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE5_OFFSET)))

