LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral.h
/******************************************************************************************
************************************ 263-Flash FMPPE6 *********************************************
******************************************************************************************/
#define FLASH_PPE6    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE6_OFFSET))
#define FLASH_PPE6_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE6_OFFSET)))

/******************************************************************************************
************************************ 264-Flash FMPPE7 *********************************************
******************************************************************************************/
#define FLASH_PPE7    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE7_OFFSET))
#define FLASH_PPE7_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE7_OFFSET)))

/******************************************************************************************
************************************ 265-Flash FMPPE8 *********************************************
******************************************************************************************/
#define FLASH_PPE8    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE8_OFFSET))
#define FLASH_PPE8_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE8_OFFSET)))

/******************************************************************************************
************************************ 266-Flash FMPPE9 *********************************************
******************************************************************************************/
#define FLASH_PPE9    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE9_OFFSET))
#define FLASH_PPE9_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE9_OFFSET)))

/******************************************************************************************
************************************ 267-Flash FMPPE10 *********************************************
******************************************************************************************/
#define FLASH_PPE10    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE10_OFFSET))
#define FLASH_PPE10_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE10_OFFSET)))

/******************************************************************************************
************************************ 268-Flash FMPPE11 *********************************************
******************************************************************************************/
#define FLASH_PPE11    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE11_OFFSET))
#define FLASH_PPE11_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE11_OFFSET)))

/******************************************************************************************
************************************ 269-Flash FMPPE12 *********************************************
******************************************************************************************/
#define FLASH_PPE12    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE12_OFFSET))
#define FLASH_PPE12_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE12_OFFSET)))

/******************************************************************************************
************************************ 270-Flash FMPPE13 *********************************************
******************************************************************************************/
#define FLASH_PPE13    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE13_OFFSET))
#define FLASH_PPE13_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE13_OFFSET)))

/******************************************************************************************
************************************ 271-Flash FMPPE14 *********************************************
******************************************************************************************/
#define FLASH_PPE14    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE14_OFFSET))
#define FLASH_PPE14_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE14_OFFSET)))

/******************************************************************************************
************************************ 272-Flash FMPPE15 *********************************************
******************************************************************************************/
#define FLASH_PPE15    ((FLASH_PPE_t*) (SYSCTL_BASE + FLASH_PPE15_OFFSET))
#define FLASH_PPE15_R    (*((volatile UBase_t*) (SYSCTL_BASE + FLASH_PPE15_OFFSET)))

/******************************************************************************************
************************************ 273-Flash BOOTCFG *********************************************
******************************************************************************************/
#define SYSCTL_BOOT_CFG    ((BOOT_CFG_t*) (SYSCTL_BASE + BOOT_CFG_OFFSET))
#define SYSCTL_BOOT_CFG_R    (*((volatile UBase_t*) (SYSCTL_BASE + BOOT_CFG_OFFSET)))

/******************************************************************************************
************************************ 274-Flash USER_REG0 *********************************************
******************************************************************************************/
#define USER_REG0    ((USER_REG_t*) (SYSCTL_BASE + USER_REG0_OFFSET))
#define USER_REG0_R    (*((volatile UBase_t*) (SYSCTL_BASE + USER_REG0_OFFSET)))

/******************************************************************************************
************************************ 275-Flash USER_REG1 *********************************************
******************************************************************************************/
#define USER_REG1    ((USER_REG_t*) (SYSCTL_BASE + USER_REG1_OFFSET))
#define USER_REG1_R    (*((volatile UBase_t*) (SYSCTL_BASE + USER_REG1_OFFSET)))

/******************************************************************************************
************************************ 276-Flash USER_REG2 *********************************************
******************************************************************************************/
#define USER_REG2    ((USER_REG_t*) (SYSCTL_BASE + USER_REG2_OFFSET))
#define USER_REG2_R    (*((volatile UBase_t*) (SYSCTL_BASE + USER_REG2_OFFSET)))

/******************************************************************************************
************************************ 277-Flash USER_REG3 *********************************************
******************************************************************************************/
#define USER_REG3    ((USER_REG_t*) (SYSCTL_BASE + USER_REG3_OFFSET))
#define USER_REG3_R    (*((volatile UBase_t*) (SYSCTL_BASE + USER_REG3_OFFSET)))

uintptr_t SYSCTL__uptrBlockBaseAddress(SYSCTL_nMODULE enModuleArg);

#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_H_ */
